
# Foundations of Computer Science project

Libraries Import

In [1]:
import pandas as pd
import time
#import datetime
#from datetime import date, datetime
from pandas.io.json import json_normalize
import numpy as np
import random
pd.set_option('display.max_columns', None)

Loan Lenders Dataset Import

In [2]:
#using time.time to evaluate the script performance
start = time.time()

df_lenders = pd.read_csv("./loans_lenders.csv")

df_lenders.head()

   loan_id                                            lenders
0   483693  muc888, sam4326, camaran3922, lachheb1865, reb...
1   483738  muc888, nora3555, williammanashi, barbara5610,...
2   485000  muc888, terrystl, richardandsusan8352, sherri4...
3   486087  muc888, james5068, rudi5955, daniel9859, don92...
4   534428  muc888, niki3008, teresa9174, mike4896, david7...

# Exercise 1

Normalizing the Dataset

In [3]:
df_lenders_norm = (df_lenders.set_index(['loan_id'])
                   .apply(lambda x: x.str.split(', ').explode())
                   .reset_index())

df_lenders_norm.head()

   loan_id      lenders
0   483693       muc888
1   483693      sam4326
2   483693  camaran3922
3   483693  lachheb1865
4   483693  rebecca3499

# Exercise 2

Adding a column duration corresponding to the number of days between the disburse time and the planned expiration time of the loans.csv Dataset.

In [4]:
df_loans = pd.read_csv("./loans.csv")

df_loans.head()

,loan_id,loan_name,original_language,description,description_translated,funded_amount,loan_amount,status,activity_name,sector_name,loan_use,country_code,country_name,town_name,currency_policy,currency_exchange_coverage_rate,currency,partner_id,posted_time,planned_expiration_time,disburse_time,raised_time,lender_term,num_lenders_total,num_journal_entries,num_bulk_entries,tags,borrower_genders,borrower_pictured,repayment_interval,distribution_model
0,657307,Aivy,English,"Aivy, 21 years of age, is single and lives in ...",NaN,125.0,125.0,funded,General Store,Retail,to buy additional inventories for her sari-sa...,PH,Philippines,Ozamiz - Ozamiz City,shared,0.1,PHP,126.0,2014-01-15 02:23:45.000 +0000,2014-02-14 03:30:06.000 +0000,2013-12-22 08:00:00.000 +0000,2014-01-15 04:48:22.000 +0000,7.0,3,2,1,NaN,female,true,irregular,field_partner
1,657259,Idalia Marizza,Spanish,"Doña Idalia, esta casada, tiene 57 años de eda...","Idalia, 57, is married and lives with her husb...",400.0,400.0,funded,Used Clothing,Clothing,"To buy American clothing such as blouses, shir...",HN,Honduras,"La Lopez, Choloma",shared,0.1,HNL,201.0,2014-01-14 20:23:20.000 +0000,2014-03-26 22:25:07.000 +0000,2013-12-20 08:00:00.000 +0000,2014-02-25 06:42:06.000 +0000,8.0,11,2,1,NaN,female,true,monthly,field_partner
2,658010,Aasia,English,Aasia is a 45-year-old married lady and she ha...,NaN,400.0,400.0,funded,General Store,Retail,"to buy stock of rice, sugar and flour",PK,Pakistan,Lala Musa,shared,0.1,PKR,245.0,2014-01-16 11:32:58.000 +0000,2014-02-15 21:10:05.000 +0000,2014-01-09 08:00:00.000 +0000,2014-01-24 23:06:18.000 +0000,14.0,16,2,1,"#Woman Owned Biz, #Supporting Family, user_fav...",female,true,monthly,field_partner
3,659347,Gulmira,Russian,"Гулмире 36 лет, замужем, вместе с супругом вос...",Gulmira is 36 years old and married. She and ...,625.0,625.0,funded,Farming,Agriculture,"to buy cucumber and tomato seeds, as well as f...",KG,Kyrgyzstan,"Aravan village, Osh region",shared,0.1,KGS,171.0,2014-01-20 09:59:48.000 +0000,2014-02-21 03:10:02.000 +0000,2014-01-17 08:00:00.000 +0000,2014-01-22 05:29:28.000 +0000,14.0,21,2,1,user_favorite,female,true,monthly,field_partner
4,656933,Ricky\t,English,Ricky is a farmer who currently cultivates his...,NaN,425.0,425.0,funded,Farming,Agriculture,to buy organic fertilizer and agrochemical pr...,PH,Philippines,"Baleleng, Sto. Thomas, Isabela",shared,0.1,PHP,123.0,2014-01-14 05:46:21.000 +0000,2014-02-13 06:10:02.000 +0000,2013-12-17 08:00:00.000 +0000,2014-01-14 17:29:27.000 +0000,7.0,15,2,1,"#Animals, #Eco-friendly, #Sustainable Ag",male,true,bullet,field_partner

Turning date from str format to Timestamp using pd.to_datetime()

In [5]:
df_loans['planned_expiration_time'] = pd.to_datetime(df_loans['planned_expiration_time'])
df_loans['disburse_time'] = pd.to_datetime(df_loans['disburse_time'])
df_loans['duration'] = (df_loans['planned_expiration_time'] - df_loans['disburse_time']).apply(lambda x: x.days)

df_loans['duration']

0          53.0
1          96.0
2          37.0
3          34.0
4          57.0
           ...
1419602    39.0
1419603    39.0
1419604    51.0
1419605    63.0
1419606    61.0
Name: duration, Length: 1419607, dtype: float64

# Exercise 3

Lenders that have funded at least twice.

In [6]:
df_lenders_and_loans = pd.merge(df_lenders_norm, df_loans[['loan_id','status','loan_amount']], on = "loan_id")
loan_funded = df_lenders_and_loans.loc[df_lenders_and_loans['status'].isin(['funded'])]

loan_funded['lenders'].value_counts().loc[lambda x: x >= 2]

gooddogg1           167512
trolltech4460       141268
gmct                123164
nms                  96713
themissionbeltco     74067
                     ...
rowan4339                2
shannon4894              2
amber5326                2
nick3320                 2
tim4190                  2
Name: lenders, Length: 893981, dtype: int64

# Exercise 4

Number of loans that have involved each country as borrowers.

In [7]:
df_loans['country_name'].value_counts()

Philippines         285336
Kenya               143699
Peru                 86000
Cambodia             79701
El Salvador          64037
                     ...
Mauritania               1
Canada                   1
Uruguay                  1
Papua New Guinea         1
Botswana                 1
Name: country_name, Length: 96, dtype: int64

# Exercise 5

Overall amount of money borrowed per Country.

In [8]:
country_borrowed_amount = df_loans.groupby('country_code')['loan_amount'].sum()

country_borrowed_amount

country_code
AF     1967950.0
AL     4307350.0
AM    22950475.0
AZ    14784625.0
BA      477250.0
         ...
XK     3083025.0
YE     3444000.0
ZA     1006525.0
ZM     1978975.0
ZW     5851875.0
Name: loan_amount, Length: 95, dtype: float64

# Exercise 6

Overall amount of money borrowed per Country as percentage.

In [9]:
#country_borrowed_amount = df_loans.groupby('country_code')['loan_amount'].sum()

In [10]:
country_borrowed_amount / df_loans['loan_amount'].sum() *100

country_code
AF    0.166573
AL    0.364586
AM    1.942589
AZ    1.251410
BA    0.040396
        ...
XK    0.260955
YE    0.291509
ZA    0.085195
ZM    0.167506
ZW    0.495318
Name: loan_amount, Length: 95, dtype: float64

# Exercise 7

Number of loans that have involved each country as borrowers, divided for each year.

In [11]:
df_loans.groupby([df_loans['country_name'
                              ],df_loans['disburse_time'].dt.year])['country_name'].value_counts()

country_name  disburse_time  country_name
Afghanistan   2007.0         Afghanistan      408
              2008.0         Afghanistan      370
              2009.0         Afghanistan      678
              2010.0         Afghanistan      632
              2011.0         Afghanistan      247
                                             ...
Zimbabwe      2013.0         Zimbabwe         426
              2014.0         Zimbabwe        2078
              2015.0         Zimbabwe         600
              2016.0         Zimbabwe         808
              2017.0         Zimbabwe        1079
Name: country_name, Length: 748, dtype: int64

Overall amount of money borrowed per Country, divided for each year.

In [12]:
df_loans.groupby([df_loans['country_name'
                          ],df_loans['disburse_time'].dt.year])['loan_amount'].sum()

country_name  disburse_time
Afghanistan   2007.0            194975.0
              2008.0            365375.0
              2009.0            585125.0
              2010.0            563350.0
              2011.0            245125.0
                                 ...
Zimbabwe      2013.0            678525.0
              2014.0           1311575.0
              2015.0            723625.0
              2016.0            788600.0
              2017.0           1237600.0
Name: loan_amount, Length: 748, dtype: float64

Overall amount of money borrowed per Country as percentage, divided for each year.

In [13]:
df_loans.groupby([df_loans['country_name'],
                    df_loans['disburse_time'].dt.year])['loan_amount'].sum() / df_loans['loan_amount'].sum() *100

country_name  disburse_time
Afghanistan   2007.0           0.016503
              2008.0           0.030926
              2009.0           0.049527
              2010.0           0.047683
              2011.0           0.020748
                                 ...
Zimbabwe      2013.0           0.057432
              2014.0           0.111015
              2015.0           0.061250
              2016.0           0.066749
              2017.0           0.104754
Name: loan_amount, Length: 748, dtype: float64

# Exercise 8

Overall amount of money lent for each lender.

In [14]:
df_loans['lenders_contribute'] = df_loans['loan_amount'] / df_loans['num_lenders_total']

df_lenders_contribute = pd.merge(df_lenders_norm, df_loans[['loan_id'
                                                            ,'lenders_contribute']]
                                 , on = "loan_id")

df_lenders_contribute.groupby('lenders')['lenders_contribute'].sum()

lenders
000                1563.881085
00000              1249.947363
0002               2201.180463
00mike00             38.461538
0101craign0101     2424.088932
                      ...
zzmcfate          60150.832762
zzpaghetti9994       44.247788
zzrvmf8538          551.829575
zzzsai              236.888048
zzzworld             26.315789
Name: lenders_contribute, Length: 1383799, dtype: float64

# Exercise 9

Difference between the overall amount of money lent and the overall amount of money borrowed per Country.

In [15]:
df_lenders_tot = pd.read_csv("./lenders.csv")

df_lenders_tot.head()

,permanent_name,display_name,city,state,country_code,member_since,occupation,loan_because,loan_purchase_num,invited_by,num_invited
0,qian3013,Qian,NaN,NaN,NaN,1461300457,NaN,NaN,1.0,NaN,0
1,reena6733,Reena,NaN,NaN,NaN,1461300634,NaN,NaN,9.0,NaN,0
2,mai5982,Mai,NaN,NaN,NaN,1461300853,NaN,NaN,NaN,NaN,0
3,andrew86079135,Andrew,NaN,NaN,NaN,1461301091,NaN,NaN,5.0,Peter Tan,0
4,nguyen6962,Nguyen,NaN,NaN,NaN,1461301154,NaN,NaN,NaN,NaN,0

In [16]:
def distribution(country_code):
    random.seed(369)
    value = pd.unique(country_code.dropna())
    percent = country_code.dropna().value_counts() / len(country_code.dropna())
    index_where_nan = country_code.index[country_code.isnull()]
    return ({'values' : value, 'probs' : percent, 'index_where_nan' : index_where_nan})

In [17]:
dictionary = distribution(df_lenders_tot['country_code'])
randomizing_country_code = pd.Series(np.random.choice(dictionary['values'], p = dictionary['probs'], size = 1458635), 
                                index = dictionary['index_where_nan'])
df_lenders_tot['country_code'].fillna(randomizing_country_code, inplace = True)

In [18]:
country_received = df_loans.groupby(['country_code'])['loan_amount'].sum().reset_index( name = 'received')
df_merged = pd.merge(df_lenders_contribute, df_lenders_tot[['permanent_name', 'country_code']], left_on = 'lenders',
                    right_on = 'permanent_name')

country_lended = df_merged.groupby('country_code')['lenders_contribute'].sum().reset_index(name = 'lent')
lended_received_country = pd.merge(country_lended, country_received, on = 'country_code', how = 'outer')
lended_received_country.fillna(0, inplace = True)
lended_received_country['difference'] = lended_received_country['lent'] - lended_received_country['received']

lended_received_country

    country_code          lent   received    difference
0             AD  2.286583e+04        0.0  2.286583e+04
1             AE  1.731701e+06        0.0  1.731701e+06
2             AF  1.274920e+05  1967950.0 -1.840458e+06
3             AG  7.732945e+02        0.0  7.732945e+02
4             AI  5.478580e+02        0.0  5.478580e+02
..           ...           ...        ...           ...
230           YT  4.529018e+03        0.0  4.529018e+03
231           ZA  4.893572e+05  1006525.0 -5.171678e+05
232           ZM  3.574739e+04  1978975.0 -1.943228e+06
233           ZW  6.159879e+03  5851875.0 -5.845715e+06
234           TD  0.000000e+00    20075.0 -2.007500e+04

[235 rows x 4 columns]

# Exercise 10

Country with the highest ratio between the difference computed at Exercise 9 and the population.

In [19]:
df_stats = pd.read_csv("./country_stats.csv")

df_stats

,country_name,country_code,country_code3,continent,region,population,population_below_poverty_line,hdi,life_expectancy,expected_years_of_schooling,mean_years_of_schooling,gni,kiva_country_name
0,India,IN,IND,Asia,Southern Asia,1339180127,21.9,0.623559,68.322,11.696590,6.298834,5663.474799,India
1,Nigeria,NG,NGA,Africa,Western Africa,190886311,70.0,0.527105,53.057,9.970482,6.000000,5442.901264,Nigeria
2,Mexico,MX,MEX,Americas,Central America,129163276,46.2,0.761683,76.972,13.299090,8.554985,16383.106680,Mexico
3,Pakistan,PK,PAK,Asia,Southern Asia,197015955,29.5,0.550354,66.365,8.106910,5.089460,5031.173074,Pakistan
4,Bangladesh,BD,BGD,Asia,Southern Asia,164669751,31.5,0.578824,71.985,10.178706,5.241577,3341.490722,Bangladesh
...,...,...,...,...,...,...,...,...,...,...,...,...,...
169,Somalia,SO,SOM,Africa,Eastern Africa,14742523,NaN,NaN,NaN,NaN,NaN,NaN,Somalia
170,Central African Republic,CF,CAF,Africa,Middle Africa,4659080,NaN,0.352440,51.458,7.098980,4.230000,587.473961,Central African Republic
171,Samoa,WS,WSM,Oceania,Polynesia,196440,NaN,0.702000,NaN,NaN,NaN,NaN,Samoa
172,Palestine,PS,PS,Asia,Western Asia,4920724,NaN,0.677000,NaN,NaN,NaN,NaN,Palestine
173,Kosovo,XK,NaN,Europe,Southern Europe,1895250,30.0,0.786000,NaN,NaN,NaN,NaN,Kosovo

In [20]:
#difference = pd.DataFrame(df_amount_per_country['loan_amount_x'] - df_amount_per_country['loan_amount_y'])

In [21]:
loan_amount_by_country = pd.merge(received_lended_by_country, df_stats[['population_below_poverty_line','country_code' , 'population']]
                                  , on = 'country_code')

loan_amount_by_country = loan_amount_by_country.set_index('country_code')

(loan_amount_by_country['difference'] / loan_amount_by_country['population']).idxmax()

NameError: name 'received_lended_by_country' is not defined

# Exercise 11

Country with the highest ratio between the difference computed at Exercise 9 and the population below the poverty line.

In [ ]:
#loan_amount_by_country = pd.merge(difference, df_stats[['population_below_poverty_line', 'country_code', 'population']], on = 'country_code')
#loan_amount_by_country= loan_amount_by_country.set_index('country_code')

loan_amount_by_country['population_not_below_poverty_line'] = 100 - loan_amount_by_country['population_below_poverty_line']

loan_amount_by_country['population_not_below_poverty_line']

In [ ]:
(loan_amount_by_country['difference'] / loan_amount_by_country['population_not_below_poverty_line']).idxmax()

# Exercise 12

Day-Weighted total amount of loans for each year.

In [ ]:
#func that returns the number of days taking place between two dates
def day_calc(date1, date2):
    
    #because sometimes planned_expiration_time is after in time than disburse time,
    #the function takes as date1 the first date in time between planned_expiration_time and disburse_time
    (begin,end) = (date1,date2) if date1<date2 else (date2,date1)
    date_list = list()
    date_list.append(begin)
    
    for y in range(begin.year+1, end.year+1):
        date_list.append(pd.Timestamp(year=y, month=1, day=1, tz='utc'))
    date_list.append(end)
    
    res = dict()
    for i in range(len(date_list)-1):
        res[date_list[i].year] = (date_list[i+1] - date_list[i]).days

    return pd.Series(res, name = 'DateValue')

data_loans = df_loans.dropna(subset = ['planned_expiration_time', 'disburse_time'])

# applying the day_calc function using .apply 
df_day_weighted = data_loans.apply(lambda x: day_calc(x['planned_expiration_time'],x['disburse_time']), axis = 1)
df_day_weighted.head()

In [ ]:
#converting duration values to absolute values
df_loans['duration'] = df_loans['duration'].abs()

#concat using pandas index properties
df_day_weighted.fillna(0, inplace= True)
df_day_weighted = pd.concat([df_day_weighted, data_loans['loan_amount']
                             , data_loans['duration'] ]
                            , axis = 1, sort = True)

In [ ]:
loan = df_day_weighted[[2011,2012,2013,2014,2015,2016,2017,2018
                        ]].div(df_day_weighted.duration, axis=0).mul(df_day_weighted.loan_amount, axis = 0)

#total amount of loans for each year
loan.sum()

In [ ]:
#using time.time to evaluate the script performance
end = time.time()

print("This script took: {} minutes".format(int((end-start)/60)))